app/views/sessions/show.html.erb


  <% @session.buds.each do | bud | %>
---
SELECT "buds".* FROM "buds" WHERE "buds"."session_id" = ?  [["session_id", 1]]


    <% if !bud.locations.empty? %>
---
SELECT "locations".* FROM "locations" WHERE "locations"."bud_id" = ?  [["bud_id", 1]]