app/controllers/api_locations_controller.rb

INSERT INTO "buds" ("identifier", "session_id", "created_at", "updated_at", "uuid") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["identifier", "Left"], ["session_id", 2], ["created_at", 2017-03-27 05:23:22 UTC], ["updated_at", 2017-03-27 05:23:22 UTC], ["uuid", "a"]]
SELECT  "buds".* FROM "buds" WHERE "buds"."uuid" = $1 AND "buds"."session_id" = $2 ORDER BY "buds"."id" ASC LIMIT $3  [["uuid", "e"], ["session_id", 5], ["LIMIT", 1]]
UPDATE "buds" SET "identifier" = $1, "updated_at" = $2 WHERE "buds"."id" = $3  [["identifier", "Left"], ["updated_at", 2017-03-28 03:02:34 UTC], ["id", 6]]
INSERT INTO "locations" ("latitude", "longitude", "bud_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", -23.5], ["longitude", 153.1], ["bud_id", 4], ["created_at", 2017-03-27 05:39:06 UTC], ["updated_at", 2017-03-27 05:39:06 UTC]]
---
  def create

    session = Session.find_or_create_by(uuid: @json['session']['uuid'])
    session.platform = @json['session']['platform']

    bud = Bud.where(:uuid => @json['bud']['uuid'], :session_id => session.id).first_or_create

    # bud = Bud.find_or_create_by(uuid: @json['bud']['uuid'])
    bud.identifier = @json['bud']['identifier']
    # bud.session_id = session.id
    bud.save

    location = Location.new
    location.latitude = @json['location']['latitude']
    location.longitude = @json['location']['longitude']
    location.bud_id = bud.id
    location.save