app/controllers/buds_controller.rb

SELECT "buds".* FROM "buds"
---
  def index
    @buds = Bud.all

INSERT INTO "buds" ("identifier", "session_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["identifier", "LEFT"], ["session_id", 1], ["created_at", 2017-03-25 02:41:50 UTC], ["updated_at", 2017-03-25 02:41:50 UTC]]
---
  def create
    @bud = Bud.new(bud_params)

    respond_to do |format|
      if @bud.save

UPDATE "buds" SET "identifier" = $1, "updated_at" = $2 WHERE "buds"."id" = $3  [["identifier", "RIGHT"], ["updated_at", 2017-03-25 02:42:14 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @bud.update(bud_params)

SELECT  "buds".* FROM "buds" WHERE "buds"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_bud
      @bud = Bud.find(params[:id])