app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("latitude", "longitude", "accuracy", "bud_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["latitude", -27.551], ["longitude", 153.034], ["accuracy", 10.0], ["bud_id", 1], ["created_at", 2017-03-25 02:42:43 UTC], ["updated_at", 2017-03-25 02:42:43 UTC]]

  def update
    respond_to do |format|
      if @location.update(location_params)
---
UPDATE "locations" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["latitude", -27.551], ["longitude", 153.034], ["updated_at", 2017-03-24 08:50:38 UTC], ["id", 1]]